# Задача-1: поработайте с переменными, создайте несколько,
# выведите на экран, запросите от пользователя и сохраните в переменную, выведите на экран


age = int(20)
weight = int(77)
print('Иван говорит, что ему', age, 'лет,', 'и для него', weight, 'кг - это норма' )
your_age = int(input('Сколько вам лет? '))
your_straight = int(input('Какой у вас рост? '))
your_weight = int(input('Сколько вы весите?'))
print('Твой возраст', your_age, 'лет,', ' и ты весишь', your_weight, 'кг, омг, кушай больше')



