# Задача-2: Запросите от пользователя чиLсло, сохраните в переменную,
# прибавьте к числу 2 и выведите результат на экран.
# Если возникла ошибка, прочитайте ее, вспомните урок и постарайтесь устранить ошибку.

number = int(input("Введите любое число, мы прибавим к нему 2: "))
print (number + 2)